tutorials/incompressible/MRFSimpleFoam/mixerVessel2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p GAMG
    {
        tolerance        1e-8;
        relTol           0.05;

        smoother         GaussSeidel;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 20;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    U smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };

    k smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };

    epsilon smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    k               0.5;
    epsilon         0.5;
}

// ************************************************************************* //
